Autodesk.Revit.DB.ClassificationEntry.HasInvalidKey
Checks if the key matches the level and parent key.
Returns:
True if the key doesn't matach the level and parent key.
False otherwise.
Since:
2015

Autodesk.Revit.DB.ClassificationEntry.HasBadCategoryId
Checks if the category id is Revit BuiltInCategory id.
Returns:
True if the category id is not Revit BuiltInCategory id.
False otherwise.
Since:
2015

Autodesk.Revit.DB.ClassificationEntry.HasBadLevel
Checks if the level is an integer in range between 1 and 5 inclusive.
Returns:
True if the level is not an integer from 1 to 5 inclusive. False otherwise.
Since:
2015

Autodesk.Revit.DB.ClassificationEntry.Description
The description associated with this entry.
Since:
2015

Autodesk.Revit.DB.ClassificationEntry.CategoryId
The id of the category associated with this entry.
Since:
2015

Autodesk.Revit.DB.ClassificationEntry.Level
The entry level in the classification table. The expected range is between 1 and 5 inclusive.
Since:
2015

Autodesk.Revit.DB.ClassificationEntry.#ctor(System.String,System.String,System.String,System.Int32,Autodesk.Revit.DB.ElementId)
Constructs a ClassificationEntry object
key:
The key of this ClassificationEntry.
parentKey:
The parent key of this ClassificationEntry.
description:
The description associated with this ClassificationEntry.
level:
The level of this ClassficationEntry.
categoryId:
The category id of this ClassificationEntry.
The category can be invalidElementId, otherwise it must represent Revit existing category.
Throws Autodesk.Revit.Exceptions.ArgumentException:
key is an empty string.
-or-
The categoryId is not appropriate category id for classfication entry.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ClassificationEntry
Represents an entry in the classification table.
Since:
2015